package function;

public class mainClass {

	public static void main(String[] args) {
		/*function == 함수

				매개변수-------------------
				|
				|		
				|		처리
				|
				|---------------리턴값 ----
				
									

								


			parameter(인수, 인자)==(매개변수) 불리는 단어를 다 외우야함
			매개 변수는 27개까지 가능하지만 넘을일이 거의 없다.
			매개 변수는 들어가는값이N개 or 없다.
			매개 변수의 리턴값은 한개 or 없다.
			
			당연하지만 들어가는 값이 많으면 처리 과정이 길어진다.
			
			어떤 값이 들어가서 -> 처리를해서 -> retrun value( 값을 받게된다. )
			
			1번, 2번, 3번, 4번
			
			2번에서 계산처리를 했다. 만약에 계산처리가 필요한 시점이 2번도 가능하고
			4번도 가능하다 하면 2, 4번의 공통의 처리를 만들어준다 그 만들어준게 function 이다
			공통의 처리를 하는경우 둘다 코드를 쓸 필요가 없이 값을 넣어주면 값이 나오는 함수를 만들어 주어서
			사용자 가 값만 넣으면 나오게끔 한다.



		*/
	}

}
